#ifndef __TTY_COM_H__
#define __TTY_COM_H__

/*******************************************************************
* ¹¦ÄÜ£º            ÉèÖÃ´®¿ÚÊı¾İÎ»£¬Í£Ö¹Î»ºÍĞ§ÑéÎ»
* Èë¿Ú²ÎÊı£º        fd         ´®¿ÚÎÄ¼şÃèÊö·û
*                   speed      ´®¿ÚËÙ¶È
*                   flow_ctrl  Êı¾İÁ÷¿ØÖÆ
*                   databits   Êı¾İÎ»   È¡ÖµÎª 7 »òÕß8
*                   stopbits   Í£Ö¹Î»   È¡ÖµÎª 1 »òÕß2
*                   parity     Ğ§ÑéÀàĞÍ È¡ÖµÎªN,E,O,,S
*³ö¿Ú²ÎÊı£º         ÕıÈ··µ»ØÎª1£¬´íÎó·µ»ØÎª0
*******************************************************************/
int UARTx_Set(int fd, int speed, int flow_ctrl, int databits, int stopbits, int parity);

/*******************************************************************
* Ãû³Æ£º           UART0_Recv
* ¹¦ÄÜ£º           ½ÓÊÕ´®¿ÚÊı¾İ
* Èë¿Ú²ÎÊı£º       fd          :ÎÄ¼şÃèÊö·û    
*                  rcv_buf     :½ÓÊÕ´®¿ÚÖĞÊı¾İ´æÈërcv_buf»º³åÇøä¸??*                  data_len    :Ò»Ö¡Êı¾İµÄ³¤¶È
* ³ö¿Ú²ÎÊı£º       ÕıÈ··µ»ØÎª1£¬´íÎó·µ»ØÎª0
*******************************************************************/
int UARTx_Recv(int fd, char *rcv_buf,int data_len);

/*******************************************************************
* Ãû³Æ£º            UART0_Send
* ¹¦ÄÜ£º            ·¢ËÍÊı¾İ
* Èë¿Ú²ÎÊı£º         fd         :ÎÄ¼şÃèÊö·û    
*                   send_buf    :å??·Å´®¿Ú·¢ËÍÊı¾İ
*                   data_len    :Ò»Ö¡Êı¾İµÄ¸öæ??
* ³ö¿Ú²ÎÊı£º        ÕıÈ··µ»ØÎª1£¬´íÎó·µ»ØÎª0
*******************************************************************/
int UARTx_Send(int fd, char *send_buf,int data_len);


/*****************************************************************
* ¹¦ÄÜ£º         ´ò¿ª´®¿Ú²¢·µ»Ø´®¿ÚÉè±¸ÎÄ¼şÃèÊö
* Èë¿Ú²ÎÊı£º     fd:ÎÄ¼şÃèÊö·û   port:´®¿ÚºÅ(ttyS0,ttyS1,ttyS2)
* ³ö¿Ú²ÎÊı£º     ÕıÈ··µ»ØÎª1ï¼????Îó·µ»ØÎª0
*****************************************************************/
int UARTx_Open(int fd, const char * ttyX);

#endif
